import requests

# 英雄名称和对应的ID
heroes = {
    '廉颇': 105, '小乔': 106, '赵云': 107, '墨子': 108, '妲己': 109,
    '嬴政': 110, '孙尚香': 111, '鲁班七号': 112, '庄周': 113, '刘禅': 114,
    '高渐离': 115, '荆轲': 116, '钟无艳': 117, '孙膑': 118, '扁鹊': 119,
    '白起': 120, '芈月': 121, '诸葛亮（旧版）': 122, '吕布': 123, '周瑜': 124,
    '庞统': 125, '夏侯惇': 126, '甄姬': 127, '曹操': 128, '典韦': 129,
    '宫本武藏': 130, '李白': 131, '马可波罗': 132, '狄仁杰': 133, '达摩': 134,
    '项羽': 135, '武则天': 136, '司马懿': 137, '孔夫子': 139, '关羽': 140,
    '貂蝉': 141, '安琪拉': 142, '安绿山': 143, '程咬金': 144, '露娜': 146,
    '姜子牙': 148, '刘邦': 149, '韩信': 150, '王昭君': 152, '兰陵王': 153,
    '花木兰': 154, '艾琳': 155, '张亮（旧）': 156, '不知火舞': 157, '八神庵': 158,
    '娜可露露': 162, '橘右京': 163, '亚瑟王': 166, '孙悟空': 167, '牛': 168,
    '后羿': 169, '刘备': 170, '张飞': 171, '李元芳': 173, '虞姬': 174,
    '钟馗': 175, '杨玉环': 176, '成吉思汗': 177, '杨戬': 178, '女娲': 179,
    '哪吒': 180, '干将（旧）': 182, '雅典娜': 183, '蔡文姬': 184, '太乙真人': 186,
    '东皇太一': 187, '鬼谷子': 189, '诸葛亮': 190, '大乔': 191, '黄忠': 192,
    '铠': 193, '苏烈': 194, '百里玄策': 195, '百里守约': 196, '异星': 197,
    '梦奇': 198, '公孙离': 199, '封王': 207, '徐福': 222, '庞统（傀儡）': 225,
    '觉醒关羽': 240, '金龙': 241, '黑龙': 242, '红龙': 243, '绿龙': 244,
    '花木兰（重剑）': 254, '司马懿（改版）': 237, '廉颇（改版）': 305, '嬴政': 310,
    '沈梦西': 312, '宫本武藏（强化）': 330, '马可': 332, '马可波罗（测试）': 333,
    '露娜（改版）': 346, '艾琳（改版）': 355, '张亮': 356, '亚瑟（改版）': 366,
    '杨戬（改版）': 378, '干将': 382, '明世隐': 501, '裴擒虎': 502, '狂铁': 503,
    '米莱迪': 504, '摇': 505, '云中君': 506, '李信': 507, '加罗': 508,
    '盾山': 509, '孙策': 510, '猪八戒': 511, '囚徒': 512, '上官婉儿': 513,
    '嫦娥': 515, '舜': 516, '马超': 518, '少司命': 520, '东方耀': 522,
    '西施': 523, '蒙犽': 524, '鲁班大师': 525, '王翦': 526, '蒙恬': 527,
    '吕蒙': 528, '盘古': 529, '宫本武藏': 530, '镜': 531, '镜分身': 532,
    'Zombie': 619, '韩信': 620, '庄周': 621, '宫本武藏（改版强化）': 630,
    '母僵尸': 654, 'Zombie': 668, 'Zombie': 675, 'Zombie': 687,
    '坦克轮子': 700, '坦克炮管': 701, 'Zombie': 716, '马可波罗（旧）': 732,
    '刘备（旧）': 733, '暴君': 770
}

# 英雄名称
hero_name = input("请输入英雄名称: ")

# 根据英雄名称查找对应的ID
hero_id = heroes.get(hero_name)

# 如果找到了对应的ID
if hero_id:
    # 构造请求URL
    url = f"https://game.gtimg.cn/images/yxzj/img201606/heroimg/{hero_id}/{hero_id}.jpg"
    
    # 发起请求
    response = requests.get(url)
    
    # 判断请求是否成功
    if response.status_code == 200:
        # 保存图片
        with open(f"{hero_id}.jpg", "wb") as file:
            file.write(response.content)
        print("图片下载成功！")
    else:
        print("请求失败！")
else:
    print("找不到对应的英雄ID！")
